### SYSDATE Function
The `SYSDATE` function returns the current system date and time.

In [ ]:
SELECT SYSDATE AS TODAY FROM DUAL;

In [ ]:
SELECT SYSDATE + 1 AS TOMORROW FROM DUAL;

In [ ]:
SELECT SYSDATE - 1 AS YESTERDAY FROM DUAL;

In [ ]:
SELECT SYSDATE - SYSDATE FROM DUAL;

### TO_CHAR Function (Date Formatting)
The `TO_CHAR` function converts a date to a string with a specified format.

In [ ]:
SELECT TO_CHAR(SYSDATE, 'DD/MM/YY') FROM DUAL;

In [ ]:
SELECT TO_CHAR(SYSDATE, 'DAY') FROM DUAL;

In [ ]:
SELECT TO_CHAR(SYSDATE, 'day') FROM DUAL;

In [ ]:
SELECT TO_CHAR(SYSDATE, 'DY') FROM DUAL;

### SYSTIMESTAMP Function
The `SYSTIMESTAMP` function returns the system date and time with fractional seconds and time zone.

In [ ]:
SELECT SYSTIMESTAMP FROM DUAL;

In [ ]:
SELECT TO_CHAR(SYSTIMESTAMP, 'HH:MI:SS') FROM DUAL;

### TO_DATE Function
The `TO_DATE` function converts a string into a date using the specified format.

In [ ]:
SELECT TO_DATE('24/09/25', 'DD/MM/YY') FROM DUAL;

### TO_CHAR with HIREDATE
Query to list all employees who joined on Thursday using `TO_CHAR` on the hire date.

In [ ]:
SELECT * FROM EMP WHERE TO_CHAR(HIREDATE, 'DAY') = 'THURSDAY';

### ADD_MONTHS Function
The `ADD_MONTHS` function adds a specified number of months to a date.

In [ ]:
SELECT ename, ADD_MONTHS(hiredate, 6) AS review_date FROM emp;

### LAST_DAY Function
The `LAST_DAY` function returns the last day of the month for a given date.

In [ ]:
SELECT LAST_DAY(SYSDATE) AS month_end FROM dual;

### MONTHS_BETWEEN Function
The `MONTHS_BETWEEN` function returns the number of months between two dates.

In [ ]:
SELECT ename, MONTHS_BETWEEN(SYSDATE, hiredate) AS months_worked FROM emp;

### NEXT_DAY Function
The `NEXT_DAY` function returns the date of the next specified weekday after a given date.

In [ ]:
SELECT NEXT_DAY(SYSDATE, 'FRIDAY') AS next_friday FROM dual;